// 1)შექმენით ობიექტი სახელად Person,ობიექტს ექნება სახელი,გვარი,ასაკი.
const Person = {
  name: "Giorgi",
  year: "1993",
  city: "Tbilisi",
}
console.log(Person);

// 2)დაამატეთ ობიექტში  ფუნქცია სახელად  sayHello რომელიც დაპრინტავს ობიექტში 
// სახელის values.

// 3) წაშალეთ ასაკის property.

// 4)დაამატეთ ობიექტში job.

// 5)დაამატეთ ობიექტში ფუნქცია რომელიც დააბრუნებს ობიექტის job-ის სიგრძეს.

// 6)ამის შემდეგ დაპრინტეთ უბრალოდ ობიექტში არსებული მეთოდების რაოდენობა.

// 7)გაარკვიეთ ,აქვს თუარა ობიექტს gender property ,თუ არაქვს ,მაშინ შექმენით მეთოდი .

// 8)გადაუარეთ for ციკლით ობიექტს და დაპრინტეთ ყველა property.

// 9)გადაუარეთ for ციკლით ობიექტს და დაპრინტეთ ყველა value. 
